In [ ]:
# Add the Pandas dependency.
import pandas as pd
import os

# List of high schools
#high_schools = ["Huang High School", "Figueroa High School", "Shelton High School", "Hernandez High School",
 #               "Griffin High School","Wilson High School", "Cabrera High School", "Bailey High School", 
  #              "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", 
   #             "Johnson High School", "Ford High School", "Thomas High School"]

#for school in high_schools:
#    print(school)

# A dictionary of high schools and the type of school.
#high_school_types = [{"High School": "Griffin", "Type":"District"},
#                    {"High School": "Figueroa", "Type": "District"},
#                    {"High School": "Wilson", "Type": "Charter"},
#                    {"High School": "Wright", "Type": "Charter"}]
#for school in high_school_types:
#    print(school)

# Create a Pandas Series from a list.
#school_series = pd.Series(high_schools)
#school_series

# A dictionary of high schools
high_school_dicts = [{"School ID": 0, "school_name": "Huang High School", "type": "District"},
                    {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

school_df = pd.DataFrame(high_school_dicts)
school_df

In [ ]:
import pandas as pd
import numpy as np
# Three separate lists of information on high schools
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

# Initialize a new DataFrame.
schools_df = pd.DataFrame()

# Add the list to a new DataFrame.
schools_df["School ID"] = school_id


schools_df ["school_name"] = school_name
schools_df ["type_of_school"] = type_of_school

# Print the DataFrame.
schools_df

schools_df.columns

In [ ]:
import pandas as pd
import numpy as np

high_schools_dict = {'School ID': school_id, 'school_name':school_name, 'type':type_of_school}

high_schools_df = (high_school_dicts)

high_schools_df

s

In [ ]:
schools_df.columns

In [ ]:
schools_df.index

In [24]:
import pandas as pd
import numpy as np

schools_id = [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14]
print (schools_id)

school_name = ["Huang High School", "Figueroa High School", "Shelton High School", "Hernandez High School","Griffin High school",
                "Wilson High School","Cabrera High School","Bailey High School","Holden High School", "Pena High School",
                "Wright High School","Rodriguez High School","Johnson High School","Ford High School","Thomas High School"]
print (school_name)

school_type = ["District","District","Charter","District","Charter",
                "Charter","Charter","District","Charter","Charter",
                "Charter","District","District","District","Charter"]
print (school_type)

pschools_df = pd.DataFrame()


pschools_df["School ID"] = schools_id


pschools_df ["school_name"] = school_name
pschools_df ["type_of_school"] = school_type
schools_df

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]
['Huang High School', 'Figueroa High School', 'Shelton High School', 'Hernandez High School', 'Griffin High school', 'Wilson High School', 'Cabrera High School', 'Bailey High School', 'Holden High School', 'Pena High School', 'Wright High School', 'Rodriguez High School', 'Johnson High School', 'Ford High School', 'Thomas High School']
['District', 'District', 'Charter', 'District', 'Charter', 'Charter', 'Charter', 'District', 'Charter', 'Charter', 'Charter', 'District', 'District', 'District', 'Charter']

   School ID            school_name type_of_school
0          0      Huang High School       District
1          1   Figueroa High School       District
2          2    Shelton High School        Charter
3          3  Hernandez High School       District
4          4    Griffin High School        Charter

In [ ]:
import pandas as pd
import numpy as np

apple_df = pd.DataFrame({"AAPL": [72.27, np.nan, 74.39, np.nan, 75.94, 76.93,np.nan, 78.74, np.nan, 79.81, np.nan, 79.53, np.nan, 79.56, 79.49]})

apple_df.isnull().sum()

In [25]:
import pandas as pd
import numpy as np
daily_returns = pd.DataFrame({
    "AAPL": [0.5, 1.37, 0.62, -0.15],
    "GOOG": [0.45, 0.63, 0.55, -0.04]
})

daily_returns

daily_returns.dropna()

   AAPL  GOOG
0  0.50  0.45
1  1.37  0.63
2  0.62  0.55
3 -0.15 -0.04

In [3]:
# Add the Pandas dependency.
import pandas as pd
import os


student_data = os.path.join('Resources', 'new_student_data.csv')
student_df = pd.read_csv(student_data)

student_df.head()

student_df["student_name"]

0            Sarah Douglas
1        Francisco Osborne
2                Ryan Haas
3             Kathryn Mack
4          Harold Reynolds
               ...
13935          Kelly Myers
13936       Kimberly Burke
13937      Crystal Merritt
13938        Misty Wiggins
13939        Michele Jones
Name: student_name, Length: 13940, dtype: object

In [1]:
import pandas as pd
import numpy as np

apple_df = pd.DataFrame({"AAPL": [72.27, np.nan, 74.39, np.nan, 75.94, 76.93,np.nan, 78.74, np.nan, 79.81, np.nan, 79.53, np.nan, 79.56, 79.49]})

apple_df

     AAPL
0   72.27
1     NaN
2   74.39
3     NaN
4   75.94
5   76.93
6     NaN
7   78.74
8     NaN
9   79.81
10    NaN
11  79.53
12    NaN
13  79.56
14  79.49

In [3]:
apple_df.isnull().sum()

AAPL    6
dtype: int64

In [4]:
import pandas as pd
import numpy as np
daily_returns = pd.DataFrame({
    "AAPL": [0.5, np.nan, 0.62],
    "GOOG": [0.45, 0.63, 0.55]
})

In [5]:
daily_returns.dropna()

   AAPL  GOOG
0  0.50  0.45
2  0.62  0.55

In [ ]:
# Replace the NaNs with "Unknown"
daily_returns = daily_returns.fillna("Unknown")

# Replace the NaNs with 0
daily_returns = daily_returns.fillna(0)

# Replace the NaNs with the mean of the column
daily_returns = daily_returns.fillna(daily_returns.mean())

In [ ]:
import pandas as pd
best_actors_df = pd.DataFrame({
    "Best Actors": ["Nic Cage", "Nic Cage", "Harrison Ford"]
})
best_actors_df

best_actors_df.duplicated()